Revit 2027 API
Parameter.Element Property
The element to which this parameter belongs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Element Element { get; }
Public ReadOnly Property Element As Element
	Get
public:
property Element^ Element {
	Element^ get ();
}
member Element : Element with get
Property Value
Element
See Also
Reference
Parameter Class
Autodesk.Revit.DB Namespace